Balanceamento de carga/benchmark/cluster-server/#1 REQ-500 02122023 1035.log
> cluster-api@1.0.0 test
> npx autocannon -c 500 -d 30 --workers 1 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ] localhost:3000

Running 2s warmup @ http://localhost:3000
1 connections
1 workers

Running 30s test @ http://localhost:3000
500 connections
1 workers

\
┌─────────┬────────┬────────┬─────────┬─────────┬────────────┬────────────┬──────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%   │ 99%     │ Avg        │ Stdev      │ Max      │
├─────────┼────────┼────────┼─────────┼─────────┼────────────┼────────────┼──────────┤
│ Latency │ 100 ms │ 736 ms │ 4176 ms │ 4814 ms │ 1090.76 ms │ 1116.43 ms │ 16304 ms │
└─────────┴────────┴────────┴─────────┴─────────┴────────────┴────────────┴──────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 102     │ 102     │ 448     │ 506     │ 430.27  │ 73.19   │ 102     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 14.6 kB │ 14.6 kB │ 64.1 kB │ 72.4 kB │ 61.5 kB │ 10.5 kB │ 14.6 kB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 12908 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 30

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 5            │
├────────────┼──────────────┤
│ 0.01       │ 5            │
├────────────┼──────────────┤
│ 0.1        │ 11           │
├────────────┼──────────────┤
│ 1          │ 67           │
├────────────┼──────────────┤
│ 2.5        │ 100          │
├────────────┼──────────────┤
│ 10         │ 236          │
├────────────┼──────────────┤
│ 25         │ 409          │
├────────────┼──────────────┤
│ 50         │ 736          │
├────────────┼──────────────┤
│ 75         │ 1305         │
├────────────┼──────────────┤
│ 90         │ 2489         │
├────────────┼──────────────┤
│ 97.5       │ 4176         │
├────────────┼──────────────┤
│ 99         │ 4814         │
├────────────┼──────────────┤
│ 99.9       │ 10501        │
├────────────┼──────────────┤
│ 99.99      │ 14850        │
├────────────┼──────────────┤
│ 99.999     │ 16304        │
└────────────┴──────────────┘

14k requests in 30.32s, 1.85 MB read
118 errors (47 timeouts)